# Задача 30:  Заполните массив элементами арифметической прогрессии. Её первый элемент, 
# разность и количество элементов нужно ввести с клавиатуры. Формула для получения n-го 
# члена прогрессии: an = a1 + (n-1) * d.
# Каждое число вводится с новой строки.

# Пример:
# Ввод: 7 2 5
# Вывод: 7 9 11 13 15

a1 = int(input('Введите значение первого элемента массива: '))
d = int(input('Введите значение разности между элементами: '))
n = int(input('Введите количество элементов: '))
an = []

for i in range(n):
    an.append(a1)
    a1 += d

print('Результат: ' + ' '.join(str(a) for a in an))