# Задача 24: В фермерском хозяйстве в Карелии выращивают чернику. Она растёт на круглой грядке, 
# причём кусты высажены только по окружности. Таким образом, у каждого куста есть ровно два соседних. 
# Всего на грядке растёт N кустов. Эти кусты обладают разной урожайностью, поэтому ко времени сбора 
# на них выросло различное число ягод — на i-ом кусте выросло ai ягод. В этом фермерском хозяйстве 
# внедрена система автоматического сбора черники. Эта система состоит из управляющего модуля и нескольких 
# собирающих модулей. Собирающий модуль за один заход, находясь непосредственно перед некоторым кустом, 
# собирает ягоды с этого куста и с двух соседних с ним.
# Напишите программу для нахождения максимального числа ягод, которое может собрать за один заход 
# собирающий модуль, находясь перед некоторым кустом заданной во входном файле грядки.

from random import randint

n = int(input('Введите количество кустов (не менее трёх!): '))
a = []
for i in range(n):
    a.append(randint(1, 9))

print(f'Сгенерированы кусты со следующей урожайностью: {a}')

max = a[0] + a[1] + a[len(a) - 1]

for i in range(1, len(a) - 1):
    sum = a[i] + a[i - 1] + a [i + 1]
    if sum > max:
        max = sum

sum = a[len(a) - 1] + a[len(a) - 2] + a[0]
if sum > max:
    max = sum

print(f'Максиум можно собрать {max} урожая за один заход!')